# HoleInRoofFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..HoleInRoofFailed Property
BuiltInFailures..::..RoofFailures Class See Also
---
Hole(s) could not be cut in roof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HoleInRoofFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HoleInRoofFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HoleInRoofFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace